Revit 2026 API

# DocumentNewAreas Method

---
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementSet NewAreas(
	List<AreaCreationData> dataList
)
```
```vb
Public Function NewAreas (
	dataList As List(Of AreaCreationData)
) As ElementSet
```
```cpp
public:
ElementSet^ NewAreas(
	List<AreaCreationData^>^ dataList
)
```
```fsharp
member NewAreas :
        dataList : List<AreaCreationData> -> ElementSet
```

#### Parameters

dataList ListAreaCreationData

#### Return Value

ElementSet

#### Reference

Document Class

Autodesk.Revit.Creation Namespace